package com.example.project;

import android.app.Notification;
import android.content.BroadcastReceiver;
import android.content.Context;
import android.content.Intent;

import androidx.core.app.NotificationCompat;
import androidx.core.app.NotificationManagerCompat;

import java.util.Random;

public class ReminderBroadcast extends BroadcastReceiver {
    String[] arr =new String[]{"يجب التركيز على النشويات الجيدة والحبوب الكاملة وتجنب السكريات.",
            "ينصح بتناول المكسرات النيئة والبيض يومياً."
            ,"ينصح بالحد من تناول الأطعمة المملّحة والمدخنة لأنها تزيد احتمالات الإصابة بسرطان المعدة عند الإفراط في تناولها."
            ,"يجب تناول 240 غ من السمك في الأسبوع أي ما يعادل مرتين أو ثلاثاً. كما يعتبر الدجاج مصدراً جيداً للبروتينات وينصح بتناوله مرتين في الأسبوع.",
            "يمكن تناول اللحوم الحمراء استثنائياً فحتى تلك التي يقال إنها خالية من الدهون تحتوي على نسبة أعلى من الدهون من السمك الغني بالدهون.",
            "يجب الحصول على 8 أو 10 حصص من الفاكهة والخضر في اليوم شرط أن تكون متنوعة للحصول على نسبة عالية من مضادات الأكسدة التي تحمي من السرطان. يتم تناول 3 حصص منها من الفاكهة والبقية من الخضر.","هل تعلم ان الإجهاد البدني والذهني من العوامل المؤثرة علي المناعة لأن الدراسات أثبتت أن الأشخاص المعرضون للإجهاد المستمر أكثر عرضة من غيرهم في الإصابة بالأمراض."
            ,"هل تعلم ان تناول السكر بكميات كبيرة من العوامل المؤثرة علي المناعة لأن السكر بيقوم بامتصاص الفيتامينات اللي بتحتاجها المناعة وده طبعا يضعفها أمام الفيروسات والميكروبات المختلفة.",
            "هل تعلم ان التدخين من العوامل المؤثرة علي المناعة لأن امراض التدخين لا تتوقف فقط عند أمراض الرئة المزمنة بل كمان التدخين بيدمر المناعة وهذا لأنه بيضعف قدرة الجهاز المناعي على مواجهة الأمراض وكمان بيعكس استجابة المناعة وبدل مهاجمة الفيروسات بتقوم بمهاجمة خلايا الجسم الصحية ."
            ,"هل تعلم ان السمنة من العوامل المؤثرة علي المناعة لأن السمنة بتمنع الشخص من الدخول في مرحلة النوم العميق وكمان الخلايا الدهنية بتمنع الخلايا المناعية من أنها تقوم بوظائفها على أكمل وجه عشان كده الأشخاص الرياضيين أكثر قدرة على مواجهة الأمراض من الأشخاص ذوي الوزن الزائد ."
            ,"هل تعلم ان قلة النوم من العوامل المؤثرة علي المناعة لأن النوم يلعب دور كبير في قوة المناعة ده لأن خلال فترة النوم بيقوم جهاز المناعة بعملية البناء للخلايا وبالتالي قلة النوم بتسبب اضطراب في عدد خلايا الدم البيضاء اللي بتواجه الأمراض ."
            ,"هل تعلم ان تناول الادوية بكثره من العوامل المؤثرة علي المناعة لأن كتير مننا بياخدوا المضادات الحيوية دون أي استشارة من طبيب وكمان بدون الالتزام بجرعات محددة وهذا للأسف بيسبب مقاومة أقل من الجسم للبكتيريا وبتزداد فرص الإصابة بالأمراض."
            ,"المناعة بتحتاج للتغذية السليمة ولما نقول سليمة ده معناه اننا محتاجين الفيتامينات والمعادن اللازمة لتقوية صحتنا ومنها فيتامين أ و ج و د وب2 وب6 والزنك وغيرهم والفيتامينات دي وجد العلماء أنها بتقوم بتعزيز الأسطح المخاطية الدفاعية والجلد كمان بتزيد من الخلايا المقاومة للعدوى والخلايا البلعمية وتقدر توفر احتياجات الجسم من الفيتامينات دي من خلال تناول اللحوم بأنواعها والألبان والخضروات الورقية والحمضيات والبقوليات والمكسرات والبيض" +
            "وعلى الجانب الآخر فنقص الفيتامينات والمعادن وعدم التغذية السليمة بيسب كتير من الأمراض الخطيرة زي فقر الدم والتهاب الجهاز الهضمي والجهاز التنفسي وجفاف الجلد والقرنية وتساقط الشعر."
            ,"تعتبر ممارسة الرياضة من الوسائل القوية لحماية جسم الإنسان من التعرض للأمراض ومهاجمة الفيروسات وبالتالي فهي تعتبر وسيلة رئيسية للحفاظ على المناعة وتقويتها  وعشان نوفر ده مش بنحتاج ممارسة الرياضة بشكل قوي بل بالعكس مجموعة من ابسط التمارين كافية أنها تقوينا جسدياً وصحيا."};

    Random random=new Random();
    int num=random.nextInt(14);
    @Override
    public void onReceive(Context context, Intent intent) {

        NotificationCompat.Builder builder=new NotificationCompat.Builder(context,"TIPSFORYOU")
                .setSmallIcon(R.drawable.mail)
                .setContentTitle("نصيحة لك ; ) ")
                .setStyle(new NotificationCompat.BigTextStyle().bigText(arr[num]))
                .setPriority(NotificationCompat.PRIORITY_DEFAULT);

        NotificationManagerCompat managerCompat=NotificationManagerCompat.from(context);
        managerCompat.notify(200,builder.build());
    }
}
